<a href="https://colab.research.google.com/github/muksung0084/mook_Repository/blob/master/20201223_%EA%B8%B0%EB%B3%B8%EB%8D%B0%EC%9D%B4%ED%84%B0_%EB%8B%A4%EB%A3%A8%EA%B8%B0_%EB%B3%B5%EC%8A%B5%EC%A0%95%EB%A6%AC.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np

##### pd.DataFrame   , loc, iloc , T(뒤집기)  , df indexing 
##### pd.Series
##### pd.Index 
##### row drop, column drop 
##### boolean array로 컬럼 선택하기 df[df[''] > 0 ] 
##### dataframe 각 value에 함수 적용 applymap ,, **
##### dataframe 컬럼 [ series ] 에 함수 적용 apply ** 
##### sort_index, values

In [3]:
data = { 'state' : ['A','B','C','C','D'],
        'year' : [ 200,2001,2002,2001,2002],
        'pop' : [1.5, 1.7, 3.6, 2.4, 2.9 ]}
frame = pd.DataFrame(data, columns=['year','state','pop'], index =['one','two','three','four','five'])    # columns로 순서를 지정할 수도 있음, index이름 지정할 수 도 있음

In [4]:
frame2 = pd.DataFrame(data, columns=['year','state','pop','non'], index =['one','two','three','four','five'])   # 컬럼에 값을 없이 넣으면, 그냥 nan값으로 박힘.

In [5]:
# data frame indexing 가능 
frame[1:3]
# index name으로도 가능 
frame['two':'five']

       year state  pop
two    2001     B  1.7
three  2002     C  3.6
four   2001     C  2.4
five   2002     D  2.9

In [6]:
print(frame2.loc[['one','two']])   # index 접근  with loc  , idx 명으로 
print()
print(frame2.iloc[0:2])           # index 접근  with iloc    , 순서로

     year state  pop  non
one   200     A  1.5  NaN
two  2001     B  1.7  NaN

     year state  pop  non
one   200     A  1.5  NaN
two  2001     B  1.7  NaN

In [7]:
frame.loc['one':'three'][['year','pop']]

       year  pop
one     200  1.5
two    2001  1.7
three  2002  3.6

In [8]:
frame2.T     # 컬럼과 인덱스 순서 뒤집기

       one   two three  four  five
year   200  2001  2002  2001  2002
state    A     B     C     C     D
pop    1.5   1.7   3.6   2.4   2.9
non    NaN   NaN   NaN   NaN   NaN

In [9]:
# series 정하기 --> indexting 하기 
# 리스트 혹은 array를 dataframe 안에 대입할때 --> 필히 대입하려는 값의 길이가 dataframe 크기( 열 개수 ) 와 같아야 함. or 특정 index에 따로 지정해줘야함. 
val = pd.Series([-1.2,-1.5,-1.7],index = ['two', 'four','five'])
frame['debt'] = val
frame

       year state  pop  debt
one     200     A  1.5   NaN
two    2001     B  1.7  -1.2
three  2002     C  3.6   NaN
four   2001     C  2.4  -1.5
five   2002     D  2.9  -1.7

In [10]:
# index 축 제목 정하기 ,  컬럼 제목 정하기 
frame.index.name = 'index name'
frame.columns.name = 'columns name'

In [11]:
frame

columns name  year state  pop  debt
index name
one            200     A  1.5   NaN
two           2001     B  1.7  -1.2
three         2002     C  3.6   NaN
four          2001     C  2.4  -1.5
five          2002     D  2.9  -1.7

In [12]:
# pd.index 정의 하기 --> 바꿀 수 없음 
index = pd.Index(range(3))

In [13]:
'one' in frame.index

True

In [14]:
frame

columns name  year state  pop  debt
index name
one            200     A  1.5   NaN
two           2001     B  1.7  -1.2
three         2002     C  3.6   NaN
four          2001     C  2.4  -1.5
five          2002     D  2.9  -1.7

In [15]:
# row 삭제 , axis = 0 
frame.drop('one')
frame.drop(['one','five'])

columns name  year state  pop  debt
index name
two           2001     B  1.7  -1.2
three         2002     C  3.6   NaN
four          2001     C  2.4  -1.5

In [16]:
# column 삭제  , axis = 1 
frame.drop('year',axis=1)
frame.drop(['year','pop'],axis=1)

columns name state  debt
index name
one              A   NaN
two              B  -1.2
three            C   NaN
four             C  -1.5
five             D  -1.7

In [17]:
# boolean으로 column choose 하기
frame[frame['debt']<0]

columns name  year state  pop  debt
index name
two           2001     B  1.7  -1.2
four          2001     C  2.4  -1.5
five          2002     D  2.9  -1.7

In [18]:
# DataFrame 혹은  Series에 함수 적용하기.  apply, applymap

sample = pd.DataFrame(np.random.randn(4,3) , columns = list('abc') , 
                      index = ['q','w','e','r'])    # random.randn으로 랜덤한 값으로 matrix 만들기 

f = lambda x: '%.f'%x    # dataframe에서 각 컬럼별 열값에 모두다 각각각가가각 이 함수를 적용하고 싶은 경우  applymap 

print(sample.applymap(f))
print()
k = lambda x : x.max() - x.min()   # 컬럼별로 적용 하고 싶은 함수식인 경우  apply

print(sample['a'].max(), sample['a'].min(),sample['a'].max()-sample['a'].min())
print()
print(sample.apply(k))

    a   b   c
q  -0   1   0
w   1   1  -2
e   0  -0   0
r  -1   0   1

0.8913962297877507 -0.8809985156006003 1.7723947453883508

a    1.772395
b    1.316233
c    2.357777
dtype: float64

In [19]:
# row, column 정렬하기  
# ascending parameter로 오름내림 기준.
print(frame )
print(frame.sort_index() )  # index 오름차순 정렬  -- ob면 알파벳 순서 
print(frame )
print(frame.sort_index(axis=1) )   # column 오른 차순 정렬 
print(frame.sort_index(axis=1,ascending = False ) )   # column 내림 차순 정렬

columns name  year state  pop  debt
index name
one            200     A  1.5   NaN
two           2001     B  1.7  -1.2
three         2002     C  3.6   NaN
four          2001     C  2.4  -1.5
five          2002     D  2.9  -1.7
columns name  year state  pop  debt
index name
five          2002     D  2.9  -1.7
four          2001     C  2.4  -1.5
one            200     A  1.5   NaN
three         2002     C  3.6   NaN
two           2001     B  1.7  -1.2
columns name  year state  pop  debt
index name
one            200     A  1.5   NaN
two           2001     B  1.7  -1.2
three         2002     C  3.6   NaN
four          2001     C  2.4  -1.5
five          2002     D  2.9  -1.7
columns name  debt  pop state  year
index name
one            NaN  1.5     A   200
two           -1.2  1.7     B  2001
three          NaN  3.6     C  2002
four          -1.5  2.4     C  2001
five          -1.7  2.9     D  2002
columns name  year state  pop  debt
index name
one            200     A  1.5   NaN
two           2001     B  1.7  -1.2
three         2002     C  3.6   NaN
four          2001     C  2.4  -1.5
five          2002     D  2.9  -1.7

In [20]:
# value에 따른 정리  --> 1차원 즉 series단위 --> column단위로 적용됨 in df 
# 따라서 원하는 컬럼을 지정해서 그 컬럼의 값크기에 따라서 정렬이 됨. --> 여러 컬럼을 순차적으로 넣으면 그 순서에 맞게 순차 적용 됨. 
# ascending parameter로 오름내림 기준.

frame.sort_values(by = ['year','debt'],ascending = False)

columns name  year state  pop  debt
index name
five          2002     D  2.9  -1.7
three         2002     C  3.6   NaN
two           2001     B  1.7  -1.2
four          2001     C  2.4  -1.5
one            200     A  1.5   NaN

In [26]:
frame['debt'].rank(method = 'first').mean(axis=0,skipna=True)   # siipna를 통해 nan 값 스킵하고 계산 or not 가능

2.0

In [22]:
frame.sum(axis =1 )

index name
one       201.5
two      2001.5
three    2005.6
four     2001.9
five     2003.2
dtype: float64

In [29]:
frame.describe()

columns name         year       pop      debt
count            5.000000  5.000000  3.000000
mean          1641.200000  2.420000 -1.466667
std            805.655447  0.864292  0.251661
min            200.000000  1.500000 -1.700000
25%           2001.000000  1.700000 -1.600000
50%           2001.000000  2.400000 -1.500000
75%           2002.000000  2.900000 -1.350000
max           2002.000000  3.600000 -1.200000

In [32]:
# 누적합 
frame.cumsum()

columns name  year  state   pop  debt
index name
one            200      A   1.5   NaN
two           2201     AB   3.2  -1.2
three         4203    ABC   6.8   NaN
four          6204   ABCC   9.2  -2.7
five          8206  ABCCD  12.1  -4.4